# <font color=#f94343>What is Pandas?<font>

In [1]:
import pandas as pd

In [9]:
data_frame = pd.read_csv('../ML/dataset/titanic/test.csv')

In [11]:
data_frame.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [12]:
data_frame.tail(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

series 는 column이며 column으로 구성된 게 data frame. 

데이터프레임은 시리즈의 결합체이다. 리스트로 만든다.

In [15]:
list_tmp = [1,2,3]
list_tmp

[1, 2, 3]

In [16]:
s1 = pd.core.series.Series([1,2,3])

In [17]:
s2 = pd.core.series.Series(['one','two','three'])

In [18]:
pd.DataFrame( data=dict(num=s1, word=s2) )

   num   word
0    1    one
1    2    two
2    3  three

# <font color=#f94343>Load dataset from files<font>

In [19]:
!conda list | grep pandas

pandas                    0.23.4           py37h830ac7b_0

In [20]:
import pandas as pd

In [21]:
df = pd.read_csv('../ML/dataset/titanic/test.csv')

In [25]:
df.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S


다른 파일도 불러올 수 있다.

쉼표가 아니라 탭으로 구분되어 있다면? **delimiter에 인자 전달**
<pre><code>pd.read_csv('file', delimiter='\t')</code></pre>

만약 컬럼의 헤더가 없다면? **header=None, names=[list]**
<pre><code>
df = pd.read_csv('file', header=None)
df.columns = ['name1', 'name2', 'name3']

#한 번에 하려면?
df = pd.read_csv('file', header=None, names= ['name1', 'name2', 'name3'])
</code></pre>

In [35]:
df=pd.read_csv('../ML/dataset/titanic/test.csv', 
               header=None, names=['one','two', 'three', 'four'])

In [36]:
df.head(1)

                                                one   two  three      four
PassengerId Pclass Name Sex Age SibSp Parch  Ticket  Fare  Cabin  Embarked

위에서 보듯이, names를 일부만 정의하면 뒤에서부터 이름이 할당된다.

# <font color=#f94343>Create dataframe<font>

In [38]:
dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Mark', 'age':32, 'job':'teacher'},
    {'name':'Dore', 'age':40, 'job':'doctor'},
]

In [39]:
df = pd.DataFrame(dict_list)

In [40]:
df

   age      job  name
0   25  student  John
1   32  teacher  Mark
2   40   doctor  Dore

키의 값의 순서가 정해지지 않기 때문에 명시적으로 정해줘야 한다.

In [43]:
header = ['name','age','job']
df = df[header]

In [44]:
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40   doctor

한 방에 하려면?

In [45]:
from collections import OrderedDict #key의 순서를 보장한다.

ordered_dict = OrderedDict(
    [
        ('name',['John', 'Mark', 'Dore']),
        ('age', [25, 32, 40]),
        ('job', ['student', 'teacher', 'doctor'])
    ]
)

In [46]:
df = pd.DataFrame.from_dict(ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40   doctor

In [47]:
data_list = [
    ['John', 25, 'student'],
    ['Mark', 32, 'teacher'],
    ['Dore', 40, 'doctor'],
]

In [48]:
header_name = ['name', 'age', 'job']

In [49]:
df = pd.DataFrame.from_records(data_list, columns=header_name)

In [50]:
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40   doctor

이것도 한 번에 하려면?

In [60]:
data_list = [
        ['name',['John', 'Mark', 'Dore']],
        ['age', [25, 32, 40]],
        ['job', ['student', 'teacher', None ]]
]

In [61]:
df = pd.DataFrame.from_items(data_list)

C:\Users\guseo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [62]:
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40     None

# <font color=#f94343>Write DataFrame To File<font>

In [54]:
df.to_csv('output.csv')

default : index, header는 True  

row id를 생략하고 싶으면? **index=false**

In [55]:
df.to_csv('output.csv', index=False)

None value는 빈 칸으로 나온다. 

이를 해결하려면? **na_rep = '-'**

In [63]:
df.to_csv('output.csv', index=False, na_rep = 'null')

# <font color=#f94343>Select, Filter Rows Columns<font>

In [64]:
df

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40     None

In [65]:
df[1:3]

   name  age      job
1  Mark   32  teacher
2  Dore   40     None

In [66]:
len(df)

3

len(df)하면 rows를 카운트한다.

In [68]:
df.loc[ [0,2] ] #location : 원하는 row의 인덱스를 넣는다.

   name  age      job
0  John   25  student
2  Dore   40     None

KeyError: 'None of [[range(0, 2)]] are in the [index]'